In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv('insurance.csv')

In [7]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [13]:
data.loc[data['sex'] == 'female', 'sex'] = '0'
data.loc[data['sex'] == 'male', 'sex'] = '1'

In [15]:
data.loc[data['smoker'] == 'yes', 'smoker'] = '1'
data.loc[data['smoker'] == 'no', 'smoker'] = '0'

In [16]:
data.head()

   age sex     bmi  children smoker     region      charges
0   19   0  27.900         0      1  southwest  16884.92400
1   18   1  33.770         1      0  southeast   1725.55230
2   28   1  33.000         3      0  southeast   4449.46200
3   33   1  22.705         0      0  northwest  21984.47061
4   32   1  28.880         0      0  northwest   3866.85520

In [24]:
data['region'].value_counts()

southeast    364
northwest    325
southwest    325
northeast    324
Name: region, dtype: int64

In [25]:
data.loc[data['region'] == 'southeast', 'region'] = '0'
data.loc[data['region'] == 'northwest', 'region'] = '1'
data.loc[data['region'] == 'southwest', 'region'] = '2'
data.loc[data['region'] == 'northeast', 'region'] = '3'

In [27]:
data.head()

   age sex     bmi  children smoker region      charges
0   19   0  27.900         0      1      2  16884.92400
1   18   1  33.770         1      0      0   1725.55230
2   28   1  33.000         3      0      0   4449.46200
3   33   1  22.705         0      0      1  21984.47061
4   32   1  28.880         0      0      1   3866.85520

In [28]:
df_shuffled=data.sample(frac=1).reset_index(drop=True)

In [29]:
df_shuffled.head()

   age sex    bmi  children smoker region     charges
0   23   1  31.73         3      1      3  36189.1017
1   62   1  38.83         0      0      0  12981.3457
2   41   0  33.06         2      0      1   7749.1564
3   48   1  30.20         2      0      2   8968.3300
4   63   1  21.66         1      0      1  14349.8544

In [30]:
df_shuffled.to_csv('SeguroMedico1.csv')